Repository: ggiewon/JPK_Wysylka
Catalog: JPK_WysylkaXML.UI.Components/Resources/Strings.*.resx
Languages: pl

# Common_BtnSaveText
source: Save
pl: Zapisz

# MainView_ValidateBtn
source: Validate
pl: Waliduj

# MainView_EditBtn
source: Edit
pl: Edytuj

# Common_BtnCancelText
source: Cancel
pl: Anuluj

# EditJPKView_NewSaleRowBtn
source: New sale row
pl: Nowy wiersz sprzedaży

# EditJPKView_NewPurchaseRowBtn
source: New purchase row
pl: Nowy wiersza zakupu

# EditJPKView_ImportRowsBtn
source: Import rows
pl: Import wierszy

# EditJPKView_DeleteSelectedRowBtn
source: Delete selected row
pl: Usuń zaznaczony wiersz

# EditJPKView_DeleteAllRowsBtn
source: Delete all rows
pl: Usuń wszystkie wiersze

# HistoryView_GenerateUpoAsPDFBtn
source: Generate UPO as PDF
pl: Generuj Upo jako PDF

# HistoryView_SaveUpoAsXmlBtn
source: Save UPO as XML
pl: Zapisz Upo jako XML

# Common_CloseBtn
source: Close
pl: Zamknij

# HistoryView_RefreshStatusBtn
source: Refresh status
pl: Odśwież statusy

# MainView_ClearLogViewToolTip
source: Clear log view
pl: Wyczyść okno logu

# MainView_SaveLogViewToolTip
source: Save log
pl: Zapisz log

# MainView_SendNoValidationBtn
source: Send without validation
pl: Wyślij bez walidacji

# MainView_SendBtn
source: Send
pl: Wyślij

# MainView_InputFileLabel
source: Input file:
pl: Plik wejściowy:

# MainView_RefNoLabel
source: Reference No:
pl: Nr referencyjny:

# MainView_FileMenuItem
source: _File
pl: _Plik

# MainView_FileExitMenuItem
source: _Exit
pl: _Wyjście

# MainView_ServerTestMenuItem
source: _Test server
pl: _Testowy

# MainView_ServerProductionMenuItem
source: _Production server
pl: _Produkcyjny

# MainView_HistoryMenuItem
source: _History
pl: _Historia

# MainView_VersionMenuItem
source: _Application version
pl: _Wersja applikacji

# MainView_SettingsMenuItem
source: _Settings
pl: _Ustawienia

# MainView_SettingsConfigurationMenuItem
source: _Configuration
pl: _Konfiguracja

# MainView_ResetEditSettingsMenuItem
source: _Reset edit JPK settings
pl: _Usuń zapiane ustawienia list w edycji

# ApplicationVersionPopup_Title
source: Application version
pl: Wersja aplikacji

# ApplicationVersionPopup_MainModuleVersionLabel
source: Main module version: {0}
pl: Wersja głównego modułu: {0}

# ApplicationVersionPopup_LoadedModulesLabel
source: Loaded modules: \n\r {0}
pl: Załadowane moduły: \n{0}

# MainView_ValidationStartedTxt
source: Validation in progress...
pl: Walidacja pliku w toku...

# MainView_ValidationEndedOkTxt
source: Validation ended. File is valid.
pl: Walidacja pliku zakończona. Plik prawidłowy.

# MainView_ValidationEndedErrorsTxt
source: Validation ended. File is invalid!
pl: Walidacja pliku zakończona. Wystąpiły błędy przy walidacji.

# MainView_UserDataTitle
source: User settings
pl: Dane użytkownika

# Common_WritePermissionsTitle
source: Write permissions
pl: Błąd zapisu

# Common_MissingLicenseTitle
source: License missing
pl: Brak licencji

# Common_MissingLicenseMessage
source: License is missing. Application works in demo mode.
pl: Brak licencji, aplikacja działa w trybie demo

# Common_MissingLicenseDetails
source: To activate the full version, upload the license file to the License sub-directory
pl: W celu aktywacji pełnej wersji należy wgrać plik licencji do podkatalogu License

# Common_CreateFolderTitle
source: Creating folder error
pl: Błąd tworzenia katalogu

# Common_CreateLicenseFolderMessage
source: The license folder could not be created.
pl: Nie udało się utworzyć folderu licencji.

# Common_CreateLicenseFolderDetails
source: The {0} directory is required, where the license files will be stored
pl: Wymagany jest katalog {0}, gdzie przechowywane będą pliki licencji

# Common_CreateLogFolderMessage
source: Failed to create log folder.
pl: Nie udało się utworzyć folderu do przechowywania logów.

# Common_CreateLogFolderDetails
source: Please contact IT to correct the error. Directory needed: {0}
pl: Proszę skontaktować się z IT w celu naprawienia błędu. Potrzebny katalog: {0}

# Common_WritePermissionsMessage
source: Unable to write to the data directory.
pl: Brak możliwości zapisu w katalogu danych.

# Common_WritePermissionsDetails
source: Please contact IT to correct the error. Data Directory: {0}
pl: Proszę skontaktować się z IT w celu naprawienia błędu. Katalog danych: {0}

# Common_ApplicationErrorTitle
source: Application error
pl: Błąd aplikacji

# Common_ApplicationErrorMessage
source: There was an error starting the application
pl: Wystąpił błąd w trakcie uruchamiania aplikacji

# Common_ApplicationErrorDetails
source: Error details: {0}
pl: Szczegóły błędu: {0}

# HistoryView_Title
source: History
pl: Historia zapytań

# HistoryView_ServerTypeHeader
source: Server
pl: Serwer

# HistoryView_RefNoHeader
source: Ref No
pl: Nr referencyjny

# HistoryView_SendDateHeader
source: Send date
pl: Data wysyłki

# HistoryView_DescriptionHeader
source: Description
pl: Opis

# HistoryView_FromDateFilter
source: Send date from:
pl: Data wysyłki od:

# HistoryView_ToDateFilter
source: to:
pl: do:

# EditJPKView_TaxOffice
source: Tax office
pl: Urząd skarbowy

# EditJPKView_SystemName
source: System name
pl: Nazwa systemu

# EditJPKView_Year
source: Year
pl: Rok

# EditJPKView_Month
source: Month
pl: Miesiąc

# EditJPKView_FormVersion
source: Form version
pl: Wariant formularza

# EditJPKView_CreationDate
source: JPK Creation date
pl: Data wytworzenia JPK

# EditJPKView_SystemCode
source: System code
pl: Kod systemowy

# EditJPKView_SchemaVersion
source: Schema version
pl: Wersja Schemy

# EditJPKView_ApplicationPurpose
source: Purpose of the application
pl: Cel złożenia

# EditJPKView_Header
source: Header
pl: Nagłówek

# EditJPKView_Declarations
source: Declarations
pl: Deklaracje

# EditJPKView_Sale
source: Sale
pl: Sprzedaż

# EditJPKView_Purchase
source: Purchase
pl: Zakupy

# EditJPKView_Title
source: Edit JPK file
pl: Edycja pliku JPK

# ConfigurationView_Title
source: Configuration
pl: Konfiguracja

# ConfigurationView_DataFolderLabel
source: Data folder:
pl: Folder danych:

# ConfigurationView_LanguageLabel
source: Language:
pl: Język:

# MainView_OpenFileErrorMessage
source: There was an error opening the file. Error: {0}
pl: Wystąpił błąd w czasie otwieranie pliku. Błąd: {0}

# MainView_ClearEditSettingsDataMessage
source: Data on lists in the JPK edition has been removed
pl: Dane dotyczące list w edycji JPK zostały usunięte

# SendFile_SendingInProgress
source: Sending file in progress...
pl: Wysyłanie pliku w toku...

# SendFile_SendingCanceledMessage
source: Sending file canceled.
pl: Użytkownik anulował wysyłanie

# SendFile_SendingWithoutValidationTitle
source: Sending without validation
pl: Wysyłka bez walidacji

# SendFile_SendingWithoutValidationQuestion
source: Do you want to send the file without validating?
pl: Czy chcesz wysłać plik bez sprawdzenia poprawności?

# SendFile_SendingTestServerTitle
source: Sending on test server
pl: Wysyłka na serwer testowy

# SendFile_SendingTestServerMessage
source: NOTE! &#13; You are sending data to the test server. To continue?
pl: UWAGA!\nWysyłasz dane na serwer testowy. Kontynuować?

# ValidateFile_ValidationWithFileMessage
source: Validation of the xml file using the {0} file
pl: Walidacja pliku xml za pomocą pliku {0}

# ValidateFile_ValidationErrorMessage
source: The validation of the xml file was not possible. Please try again later or send the file without validation
pl: Walidacja pliku xml nie była możliwa. Prosimy spróbować później lub wysłać plik bez walidacji

# ValidateFile_ValidationWithErrorsMessage
source: Xml file validation error: {0}
pl: Błąd walidacji pliku xml: {0}

# ValidateFile_LoadFileErrorMessage
source: Error loading xml file: {0}
pl: Błąd przy ładowaniu pliku xml: {0}

# SendFile_NoLicenseMessage
source: No license to send documents for NIP: {0}
pl: Brak licencji umożliwiającej wysyłkę dokumentów dla NIP'u: {0}

# SendFile_SigningMetadataMessage
source: The metadata is being signed
pl: Trwa podpisywanie metadanych

# SendFile_SignedMetadataMessage
source: Metadata signed
pl: Metadane podpisane

# SendFile_SindingMetadataMessage
source: Sending metadata ...
pl: Wysyłanie metadanych...

# SendFile_SindingMetadataResponseMessage
source: Sending metadata - server response: {0}
pl: Wysyłanie metadanych - odpowiedź serwera: {0}

# SendFile_SendingFileMessage
source: Sending files to the server
pl: Wysłanie plików na serwer

# SendFile_SintMetadataResponseMessage
source: Metadata sent. Server response: {0}
pl: Metadane wysłane. Odpowiedź serwera: {0}

# SendFile_SendingSingleFileMessage
source: Sending file: {0}
pl: Wysyłanie pliku: {0}

# SendFile_SentSingleFileMessage
source: File {0} sent.
pl: Plik {0} wysłano.

# SendFile_SendingFilesEndMessage
source: Files sent to server completed
pl: Wysłane plików na serwer zakończone

# SendFile_SendingRequestEndMessage
source: Sending request ended.Session id: {0}
pl: Wysłane żądania zakończenia sesji. Identyfikator sesji: {0}

# SendFile_SendingRequestEndResponseMessage
source: Server response: {0}
pl: Odpowiedź serwera: {0}

# SendFile_StatusCheckMessage
source: Status check: {0}
pl: Sprawdzenie statusu : {0}

# SendFile_SendErrorMessage
source: An error occurred while sending the file: {0}
pl: W trakcie wysyłania pliku wystąpił błąd : {0}
